# St7GetLBANumModes

Returns the number of modes to be calculated in linear buckling analysis.

long St7GetLBANumModes(long uID, long* NumModes)

Input Parameters

uID

Strand7 model file ID.

Output Parameters
NumModes

Number of modes to be found.